app/auth/authenticate_user.rb

	def user
		user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "frosty@gmail.com"], ["LIMIT", 1]]