app/controllers/users_controller.rb

  def signup
    user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"